Public Attributes | List of all members
API_NavigatorItem Struct Reference
Project Navigator
Represents a Project Navigator item. More...
#include <APIdefs_Navigator.h>
 Public Attributes
GS::uchar_t  | uName [API_UniLongNameLen]
The name of the navigator item.
GS::uchar_t  | uAutoTextedName [API_UniLongNameLen]
The name of the navigator item which contains the autotext tokens.
char  | uiId [128]
The ID of the navigator item.
API_Guid  | guid
The own GUID of the navigator item.
API_DatabaseInfo  | db
The database reference of the the navigator item.
short  | floorNum
Floor index the navigator item refers to. Valid only if the type of the database is floorplan [ itemType is API_StoryNavItem].
short  | vType
For internal use.
API_CutPlanePlanConn  | intendedPlanConn
The status of the link between the navigator item and the Floor Plan.
API_Guid  | camId
GUID of a single camera [ itemType is API_CameraNavItem] or a camera set [ itemType is API_CameraNavItem].
API_NavigatorMapID  | mapId
The Project Navigator map wich contains this item.
API_NavigatorItemTypeID  | itemType
Type of the item.
API_Guid  | sourceGuid
The guid of the source navigator item. For example a View item can be the source of a Drawing or a PublisherSet item.
Int32  | owner
The member ID of the item's owner in TeamWork mode (relevant only in View Map).
bool  | customName
Custom name of the item (relevant only in the View Map and Layout Map).
bool  | customUiId
Custom ID of the item (relevant only in the View Map and Layout Map).
bool  | isIndependent
True when the navigator item is independent.
Detailed Description
Represents a Project Navigator item.
Remarks
This structure holds the data of an item of the Project Navigator. The structure is used with the ACAPI_Navigator_GetNavigatorItem, ACAPI_Navigator_GetNavigatorParentItem, ACAPI_Navigator_GetNavigatorChildrenItems, ACAPI_Navigator_SearchNavigatorItem and ACAPI_Navigator_ChangeNavigatorItem functions.
Member Data Documentation
◆ camId
 API_NavigatorItem::camId
GUID of a single camera [ itemType is API_CameraNavItem] or a camera set [ itemType is API_CameraNavItem].
◆ customName
 API_NavigatorItem::customName
Custom name of the item (relevant only in the View Map and Layout Map).
◆ customUiId
 API_NavigatorItem::customUiId
Custom ID of the item (relevant only in the View Map and Layout Map).
◆ db
 API_NavigatorItem::db
The database reference of the the navigator item.
◆ floorNum
 API_NavigatorItem::floorNum
Floor index the navigator item refers to. Valid only if the type of the database is floorplan [ itemType is API_StoryNavItem].
◆ guid
 API_NavigatorItem::guid
The own GUID of the navigator item.
◆ intendedPlanConn
 API_NavigatorItem::intendedPlanConn
The status of the link between the navigator item and the Floor Plan.
◆ isIndependent
 API_NavigatorItem::isIndependent
True when the navigator item is independent.
◆ itemType
 API_NavigatorItem::itemType
Type of the item.
◆ mapId
 API_NavigatorItem::mapId
The Project Navigator map wich contains this item.
◆ owner
 API_NavigatorItem::owner
The member ID of the item's owner in TeamWork mode (relevant only in View Map).
◆ sourceGuid
 API_NavigatorItem::sourceGuid
The guid of the source navigator item. For example a View item can be the source of a Drawing or a PublisherSet item.
◆ uAutoTextedName
 API_NavigatorItem::uAutoTextedName
The name of the navigator item which contains the autotext tokens.
◆ uiId
 API_NavigatorItem::uiId
The ID of the navigator item.
◆ uName
 API_NavigatorItem::uName
The name of the navigator item.
◆ vType
 API_NavigatorItem::vType
For internal use.